compressible/rhoPimpleFoam/laminar/aeroacousticWaveTrain/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

//-----------------------------------------------------------------
//#include "parameters"

//nx     #eval{ 250 * $nref };
//ny     #eval{   5 * $nref };
//nz     #eval{   5 * $nref };
//-----------------------------------------------------------------

vertices
(
    (-1.25 -0.025 -0.025)
    ( 1.25 -0.025 -0.025)
    ( 1.25  0.025 -0.025)
    (-1.25  0.025 -0.025)
    (-1.25 -0.025  0.025)
    ( 1.25 -0.025  0.025)
    ( 1.25  0.025  0.025)
    (-1.25  0.025  0.025)
);

blocks
(
//    hex (0 1 2 3 4 5 6 7) ($nx $ny $nz) simpleGrading (1 1 1)
    hex (0 1 2 3 4 5 6 7) (250 5 5) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }
    front
    {
        type symmetryPlane;
        faces
        (
            (0 3 2 1)
        );
    }
    back
    {
        type symmetryPlane;
        faces
        (
            (5 6 7 4)
        );
    }
    bottom
    {
        type symmetryPlane;
        faces
        (
            (0 1 5 4)
        );
    }
    top
    {
        type symmetryPlane;
        faces
        (
            (3 7 6 2)
        );
    }

);

mergePatchPairs
(
);

// ************************************************************************* //
